Revit 2024 API
SymbolGeometryId Class
 This class is used to identify a piece of geometry managed by a symbol element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class SymbolGeometryId : IDisposable
Visual Basic
Public Class SymbolGeometryId _
	Implements IDisposable
Visual C++
public ref class SymbolGeometryId : IDisposable
Remarks
 This class can be used to compare if two instances points to the same piece of geometry managed by a symbol element. The string returned by AsIdentifier can be used to achieve this.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.SymbolGeometryId
See Also
SymbolGeometryId Members
Autodesk.Revit.DB Namespace